[
  "I don’t always test my code, but when I do, I do it in production.",
  "Debugging: removing the needles from the haystack.",
  "Why do programmers always mix up Christmas and Halloween? Because Oct 31 == Dec 25!",
  "There are only 10 types of people in the world: those who understand binary, and those who don’t.",
  "Programming is like sex: one mistake and you’re providing support for a lifetime.",
  "I asked the computer for a witty programming joke. It said, ‘Out of memory, please reboot.'",
  "Programmers never die, they just go offline.",
  "The best code is the one you didn’t have to write.",
  "I have a joke on programming, but it only works on my computer.",
  "I’m not lazy, I’m just on my energy-saving mode.",
  "I’m not a bug, I’m a feature!",
  "I’m not anti-social, I’m just not user-friendly.",
  "I’m not a programmer, I’m a code poet.",
  "I’m not a superhero, but I code like one.",
  "I’m not a coffee addict, I’m just Java-enabled.",
  "I’m not a procrastinator, I’m just on a coding break.",
  "I’m not lost, I’m just refactoring my location.",
  "I don’t always write code, but when I do, I make sure it’s elegant and efficient. Just kidding, I just hope it works!",
  "I don’t need luck, I have version control.",
  "I code, therefore I am… confused.",
  "The best part about being a programmer is that you can count from zero without getting weird looks.",
  "When in doubt, Ctrl+Z it out!",
  "I’m not stuck, I’m just in an infinite loop.",
  "I love deadlines. I like the whooshing sound they make as they fly by. – Douglas Adams",
  "I told my computer I needed a break, and now it keeps showing me pictures of sunny beaches.",
  "I code, therefore I am… caffeinated.",
  "I’m not a perfectionist, I’m just waiting for the compiler to finish yelling at me.",
  "I don’t have a favorite programming language, I just hate them all equally.",
  "I don’t need a social life, I have GitHub.",
  "I’m not a bug, I’m a feature in disguise.",
  "I’m not stuck, I’m just exploring alternative solutions.",
  "I don’t always write comments in my code, but when I do, I make sure they’re sarcastic.",
  "I don’t need a debugger, my code is just having an identity crisis.",
  "I’m not ignoring you, I’m just debugging my life.",
  "I don’t believe in magic, but I do believe in debugging until it works like magic.",
  "I’m not a bug whisperer, I just talk to my code when it misbehaves.",
  "I’m not a programmer, I’m a professional error finder.",
  "I’m not a hacker, I’m just creatively solving security issues.",
  "I don’t need a personal trainer, I just need a code reviewer to keep me in shape.",
  "I’m not a mind reader, but I can debug your code just by looking at it.",
  "I don’t need a social life, I have a Stack Overflow account.",
  "I’m not addicted to coding, I just have withdrawal symptoms when I don’t code.",
  "I don’t always refactor code, but when I do, it’s because I’m procrastinating.",
  "I’m not a control freak, I just like to git things in order.",
  "I’m not a keyboard warrior, I’m just a coder in battle mode.",
  "I don’t believe in ghosts, but I do believe in spooky code bugs.",
  "I’m not a magician, but I can make bugs disappear with a few lines of code.",
  "I’m not a code hoarder, I’m just passionate about version control.",
  "I don’t need a therapist, I just need a code reviewer to listen to my problems.",
  "I’m not a multitasker, I just have many terminal tabs open.",
  "I don’t always comment my code, but when I do, it’s in Klingon.",
  "I’m not a fortune teller, but I can predict that my code will break at the worst possible time.",
  "I’m not a keyboard smasher, I’m just giving my code a good beating.",
  "I don’t always use recursion, but when I do, I make sure to break the stack.",
  "I’m not a cowboy coder, I’m just a rootin’ tootin’ debugging machine.",
  "I don’t need a gym membership, I just need to carry my computer up and down the stairs every day.",
  "I’m not an architect, but I can build castles in the air with my code.",
  "I’m not a fan of spaghetti, unless it’s in my code.",
  "I don’t always drink coffee, but when I do, I make sure to spill it on my keyboard.",
  "I’m not a magician, but I can make code disappear with a single ‘rm -rf’ command.",
  "I don’t always test my code, but when I do, I do it on the production server.",
  "I’m not a time traveler, but I can debug issues that happened in the past.",
  "I’m not a fan of chaos theory, unless it’s in my code.",
  "I don’t always follow coding conventions, but when I do, it’s because I copied and pasted from Stack Overflow.",
  "I’m not a hacker, I’m just creatively finding workarounds for undocumented features.",
  "I don’t need a spell checker, I just need a debugger to catch my typos.",
  "I’m not a magician, but I can make code disappear with a single ‘Ctrl + Z’ command.",
  "I don’t always write unit tests, but when I do, I do it right before a big deadline.",
  "I’m not a math wizard, I’m just really good at counting from 0 to n-1.",
  "I’m not a computer scientist, I’m just a really good Googler.",
  "I don’t always read documentation, but when I do, it’s during a production outage.",
  "I’m not a fan of infinite loops, unless it’s in my code.",
  "I’m not a psychic, but I can predict that my code will break when the CEO is demoing it.",
  "I don’t always catch exceptions, but when I do, it’s in production.",
  "I’m not a software engineer, I’m just really good at turning caffeine into code.",
  "I don’t always understand my own code, but when I do, I’m probably dreaming.",
  "I’m not a mathematician, but I can make numbers disappear with my code.",
  "I don’t need a debugger, I just need a rubber duck to explain my code to.",
  "I’m not a perfectionist, I just like my code to be pixel perfect.",
  "I don’t always use recursion, but when I do, I make sure to overflow the stack.",
  "I’m not a mind reader, but I can predict what my code will do based on its mood.",
  "I don’t need a fancy IDE, I just need a text editor and a terminal window.",
  "I’m not a mathematician, but I can calculate how much sleep I’ll lose over a bug.",
  "I’m not a software magician, I just make code disappear into thin air.",
  "I don’t always write comments, but when I do, they’re hilarious.",
  "I’m not a code ninja, I’m just really good at finding hidden bugs.",
  "I don’t always refactor code, but when I do, I break everything in the process.",
  "I’m not a robot, I’m just powered by caffeine and pizza.",
  "I don’t always understand legacy code, but when I do, it’s a miracle.",
  "I’m not a keyboard warrior, I’m a code warrior.",
  "I don’t always debug code, but when I do, I prefer to do it in production.",
  "I’m not a magician, but I can make deadlines disappear with my code.",
  "I don’t need a break, I just need to fix one more bug.",
  "I’m not a bug hunter, I’m a bug farmer.",
  "I don’t always test my code, but when I do, I do it in production.",
  "I’m not a code poet, I just write code that rhymes.",
  "I don’t always use version control, but when I do, I make sure to commit before hitting ‘delete’.",
  "I’m not a code architect, I’m just building my code castle one line at a time.",
  "I don’t need a debugger, I just need a magic wand to fix my code.",
  "La casa del Programmatore è orientata a sud. La casa del Vero Programmatore è orientata agli oggetti.",
  "Nel caso erediti una vecchia casa, il Vero Programmatore non la ristruttura. La sovrascrive.",
  "Se il suo bucato non e' abbastanza morbido, il Vero Programmatore ricompila il Vernel.",
  "Quando il Vero Programmatore si ferma a fare benzina a un distributore IP, si meraviglia di non poterlo usare come server DHCP.",
  "Il Vero Programmatore quando va a letto esclama sleep (0x7080).",
  "Il Vero Programmatore mangia wafer di silicio",
  "Il Vero Programmatore sa che il caso non esiste. E' solo uno pseudo-caso precomputato.",
  "Il Vero Programmatore puo' condividere un appartamento su eMule.",
  "Il Vero Programmatore puo' eludere qualsiasi intercettazione telefonica semplicemente dicendo \"slash slash\" all'inizio della conversazione.",
  "Il Vero Programmatore si dichiara alla donna che ama dicendo \"private Object VeroProgrammatore; \"",
  "Se il Vero Programmatore si reca negli Stati Uniti, non ha bisogno di convertire i suoi Euro in Dollari: esegue un cast implicito.",
  "Il Vero Programmatore entra in casa dalla porta 8080.",
  "Il Vero Programmatore va a fare la spesa con una lista concatenata.",
  "Il Vero Programmatore puo' contare fino a 1024 con le dita delle mani.",
  "Il Vero Programmatore regala alla sua fidanzata un array di perle.",
  "Il Vero Programmatore programma le sue vacanze in assembler.",
  "Quando un Vero Programmatore da bambino impara a parlare, le sue prime parole non sono \"mamma\" o \"papà\" ma \" Hello, World!\"",
  "Quando un Vero Programmatore riceve le carte al tavolo da gioco, se le ordina in mano in O(nlogn) mosse.",
  "Quando a uno sportello gli viene chiesto di compilare un modulo, il Vero Programmatore esclama: \" gcc modulo.c\".",
  "Quando da piccolo a scuola il Vero Programmatore doveva fare il tema \"il mio papà\", scriveva semplicemente Papà.t",
  "Quando due Veri Programmatori si scontrano, o vanno subito in Buffer Overflow, o si affrontano per Mille Cicli di Clock senza che vi sia un vincitore. oString().",
  "Il Vero Programmatore puo' scrivere un metodo che lancia un'eccezione che conferma la regola.",
  "Il Vero Programmatore non porta fuori la spazzatura: non si fida del Garbage Collector. Si limita ad esclamare: \"Rifiuti.Dispose()!\" e l'immondizia si dissolve nel nulla.",
  "Il Vero Programmatore non iscrive i suoi figli a scuola. Ne fa comparire i nomi direttamente sul registro di classe utilizzando un puntatore.",
  "Il Vero Programmatore ha un grande rispetto per l'arte. Uno dei più grandi misteri che lo tormentano è come Leonardo sia riuscito a dipingere La Gioconda senza vertex shading.",
  "Il Vero Programmatore ha sulla parete di casa sua un quadretto con la scritta \" 127.0.0.1 sweet 127.0.0.1\".",
  "Un Vero Programmatore non usa alcun firewall. Si accorge che qualcuno è entrato nel suo computer perchè il suo personaggio di Ultima Online skippa un frame quando attacca.",
  "Il Vero Programmatore utilizza nomi di variabile tipo _abr, idGnr, o più semplicemente a. Se in un listato scritto da un Vero Programmatore trovate una variabile chiamata stipendioImpiegato, probabilmente contiene il numero di isotopi radioattivi di un reattore nucleare (il Vero Programmatore ha riciclato il codice di un suo vecchio programma di contabilità).",
  "Un test per verificare se qualcuno è un Vero Programmatore consiste nel legarlo, imbavagliarlo e chiuderlo a chiave in una stanza vuota da solo con un computer preassemblato e non overcloccato, senza alcun utensile o strumento. Se entro 30 secondi non sta uscendo del fumo da sotto la porta, il soggetto NON è un Vero Programmatore.",
  "Il Vero Programmatore chiama qualsiasi interfaccia più complessa di una shell a riga di comando con un unico nome: \"spreco di RAM\".",
  "Il Vero Programmatore non si ferma col rosso. Si ferma col #FF0000.",
  "Un Vero Programmatore finisce tutte le sue frasi con un punto e virgola;...anche quando parla;",
  "Il Programmatore puo' cancellare la cache del suo browser. Il Vero Programmatore puo' cancellare la cache di Google.",
  "Nel caso perda le chiavi di un lucchetto, il Vero Programmatore si cimenta in un lungo ed estenuante brute force .",
  "Il Programmatore va all'Ikea, compra una scrivania, la porta a casa e la monta. Al Vero Programmatore invece basta esclamare: \"apt-get install scrivania\" perche' essa appaia in tutto il suo splendore nello studio, pronta all'uso (e con una risma di fogli bianchi gia' nel primo cassetto).",
  "Per il Vero Programmatore il concetto di interfaccia grafica è rappresentato da una serie di 1 e 0 ben indentati su di un monitor monocromatico.",
  "Se poprio viene costretto a commentare il proprio codice, il Vero Programmatore disseminera' casualmente nel proprio listato qualche ovvia descrizione dei metodi piu' semplici. Le parti di codice indispensabili al funzionamento del software saranno invece precedute da un: //Non mi aspetto che tu capisca questo",
  "Quando il Vero Programmatore viene invitato ad una festa, puo' scoprire quali ragazze sono single e quali no semplicemente esclamando: \"ls -l\" .",
  "Il Vero Programmatore ha gli Gnome da giardino.",
  "La Vera Programmatrice si preoccupa quando ha un ritardo nel ciclo for.",
  "Il Vero Programmatore Ricorda con affetto il suo vecchio Spectrum. Stava giocando contro un certo Joshua a Guerra Termonucleare Globale, quando il processore si è fuso. Era il 9 novembre 1989.",
  "Qualcuno sostiene che il Vero Programmatore tiene sempre i backup da quando ha dovuto riscrivere 327000 linee di assembler 68020. In realta' il Vero Programmatore non fa alcun backup: e' piu' veloce riscrivere il software a memoria che ricordarsi dove ha messo i nastri o i cd dei backup.",
  "Una recente teoria sostiene che gli universi paralleli esistono: li fa girare il Vero Programmatore con il VMWare.",
  "Il Vero Programmatore non usa strumenti di Debug o Checkpoint. Puo' leggere il valore di una variabile durante l'esecuzione del suo programma semplicemente osservando attentamente i banchi di RAM del computer su cui lavora.",
  "Se non conosce il significato di una parola, il Programmatore consulta un dizionario. Se non conosce il significato di una parola, il Vero Programmatore consulta una tabella di hash.",
  "Il Vero Programmatore puo' formattare un disco in vinile."
]

